formosan-fox/STM32CubeIDE_source_files/Source/Inc/IMU_6DIM_WSEN_ISDS.h
#ifndef __IMU_6DIM_WSEN_ISDS_H__
#define __IMU_6DIM_WSEN_ISDS_H__

/* Device name: WSEN-ISDS INERTIAL MEASUREMENT UNIT
 * Order code: 2536030320001
 * Datasheet: https://www.we-online.com/components/products/datasheet/2536030320001.pdf
 * User Manual: https://www.we-online.com/components/products/manual/2536030320001_Manual_UM_WSEN-ISDS_2536030320001_rev1.1.pdf
 * Reference:
 *   - https://github.com/WurthElektronik/Sensors-SDK_STM32/blob/main/SensorsSDK/WSEN_ISDS_2536030320001
 *   - https://github.com/WurthElektronik/Sensors-SDK_STM32/tree/main/examples/WSEN_ISDS_SPI
 * Author: Zhi-Kai Xu
 */

#include "stdint.h"
#include "stm32l4xx_hal.h"
#include <stdbool.h>


/* ISDS 2536030320001 DEVICE_ID */
#define ISDS_DEVICE_ID_VALUE                  0x6A      /**< This is the expected answer when requesting the ISDS_DEVICE_ID_REG */

/* Available ISDS I2C slave addresses */
#define ISDS_ADDRESS_I2C_0                    0x6A << 1     /**< When SAO of ISDS is connected to ground */
#define ISDS_ADDRESS_I2C_1                    0x6B << 1     /**< When SAO of ISDS is connected to positive supply voltage */

/* Register address definitions */
#define ISDS_FIFO_CTRL_1_REG                  0x06      /**< FIFO configuration register 1 */
#define ISDS_FIFO_CTRL_2_REG                  0x07      /**< FIFO configuration register 2 */
#define ISDS_FIFO_CTRL_3_REG                  0x08      /**< FIFO configuration register 3 */
#define ISDS_FIFO_CTRL_4_REG                  0x09      /**< FIFO configuration register 4 */
#define ISDS_FIFO_CTRL_5_REG                  0x0A      /**< FIFO configuration register 5 */
#define ISDS_DRDY_PULSE_CFG_REG               0x0B      /**< Data ready configuration register */
#define ISDS_INT0_CTRL_REG                    0x0D      /**< INT0 pin control */
#define ISDS_INT1_CTRL_REG                    0x0E      /**< INT1 pin control */
#define ISDS_DEVICE_ID_REG                    0x0F      /**< Device ID register */
#define ISDS_CTRL_1_REG                       0x10      /**< Control register 1 (linear acceleration sensor) */
#define ISDS_CTRL_2_REG                       0x11      /**< Control register 2 (angular rate sensor) */
#define ISDS_CTRL_3_REG                       0x12      /**< Control register 3 */
#define ISDS_CTRL_4_REG                       0x13      /**< Control register 4 */
#define ISDS_CTRL_5_REG                       0x14      /**< Control register 5 */
#define ISDS_CTRL_6_REG                       0x15      /**< Control register 6 (angular rate sensor) */
#define ISDS_CTRL_7_REG                       0x16      /**< Control register 7 (angular rate sensor) */
#define ISDS_CTRL_8_REG                       0x17      /**< Control register 8 (linear acceleration sensor) */
#define ISDS_CTRL_9_REG                       0x18      /**< Control register 9 (linear acceleration sensor) */
#define ISDS_CTRL_10_REG                      0x19      /**< Control register 10 */
#define ISDS_WAKE_UP_EVENT_REG                0x1B      /**< Wake-up interrupt source register */
#define ISDS_TAP_EVENT_REG                    0x1C      /**< Tap source register */
#define ISDS_6D_EVENT_REG                     0x1D      /**< 6D orientation source register */
#define ISDS_STATUS_REG                       0x1E      /**< Status data register */
#define ISDS_OUT_TEMP_L_REG                   0x20      /**< Temperature output value LSB */
#define ISDS_OUT_TEMP_H_REG                   0x21      /**< Temperature output value MSB */
#define ISDS_X_OUT_L_GYRO_REG                 0x22      /**< Angular rate output value X (pitch) LSB */
#define ISDS_X_OUT_H_GYRO_REG                 0x23      /**< Angular rate output value X (pitch) MSB */
#define ISDS_Y_OUT_L_GYRO_REG                 0x24      /**< Angular rate output value Y (roll) LSB */
#define ISDS_Y_OUT_H_GYRO_REG                 0x25      /**< Angular rate output value Y (roll) MSB */
#define ISDS_Z_OUT_L_GYRO_REG                 0x26      /**< Angular rate output value Z (yaw) LSB */
#define ISDS_Z_OUT_H_GYRO_REG                 0x27      /**< Angular rate output value Z (yaw) MSB */
#define ISDS_X_OUT_L_ACC_REG                  0x28      /**< Linear acceleration output value X LSB */
#define ISDS_X_OUT_H_ACC_REG                  0x29      /**< Linear acceleration output value X MSB */
#define ISDS_Y_OUT_L_ACC_REG                  0x2A      /**< Linear acceleration output value Y LSB */
#define ISDS_Y_OUT_H_ACC_REG                  0x2B      /**< Linear acceleration output value Y MSB */
#define ISDS_Z_OUT_L_ACC_REG                  0x2C      /**< Linear acceleration output value Z LSB */
#define ISDS_Z_OUT_H_ACC_REG                  0x2D      /**< Linear acceleration output value Z MSB */
#define ISDS_FIFO_STATUS_1_REG                0x3A      /**< FIFO status register 1 */
#define ISDS_FIFO_STATUS_2_REG                0x3B      /**< FIFO status register 2 */
#define ISDS_FIFO_STATUS_3_REG                0x3C      /**< FIFO status register 3 */
#define ISDS_FIFO_STATUS_4_REG                0x3D      /**< FIFO status register 4 */
#define ISDS_FIFO_DATA_OUT_L_REG              0x3E      /**< FIFO data output register LSB */
#define ISDS_FIFO_DATA_OUT_H_REG              0x3F      /**< FIFO data output register MSB */
#define ISDS_FUNC_SRC_1_REG                   0x53      /**< Tilt interrupt source register */
#define ISDS_TAP_CFG_REG                      0x58      /**< Enables interrupt and inactivity functions, configuration of filtering and tap recognition functions */
#define ISDS_TAP_THS_6D_REG                   0x59      /**< Portrait/landscape position and tap function threshold register */
#define ISDS_INT_DUR2_REG                     0x5A      /**< Tap recognition function setting register */
#define ISDS_WAKE_UP_THS_REG                  0x5B      /**< Single and double-tap function threshold register */
#define ISDS_WAKE_UP_DUR_REG                  0x5C      /**< Free-fall, wake-up and sleep mode functions duration setting register */
#define ISDS_FREE_FALL_REG                    0x5D      /**< Free-fall function duration setting register */
#define ISDS_MD1_CFG_REG                      0x5E      /**< Functions routing on INT0 register */
#define ISDS_MD2_CFG_REG                      0x5F      /**< Functions routing on INT1 register */
#define ISDS_X_OFS_USR_REG                    0x73      /**< Accelerometer X-axis user offset correction */
#define ISDS_Y_OFS_USR_REG                    0x74      /**< Accelerometer Y-axis user offset correction */
#define ISDS_Z_OFS_USR_REG                    0x75      /**< Accelerometer Z-axis user offset correction */


