formosan-fox/STM32CubeIDE_source_files/Source/Inc/IMU_6DIM_WSEN_ISDS.h
/* Register type definitions */

/**
 * @brief ISDS_FIFO_CTRL_1_REG
 * Address 0x06
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t fifoThresholdLsb : 8;         /**< FIFO threshold level setting LSB. Default value: 0. Watermark flag rises when the number of bytes written to FIFO after the next write is greater than or equal to the threshold level. Minimum resolution for the FIFO is 1 LSB = 2 bytes (1 word) in FIFO. */
} ISDS_fifoCtrl1_t;

/**
 * @brief ISDS_FIFO_CTRL_2_REG
 * Address 0x07
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t fifoThresholdMsb : 3;         /**< FIFO threshold level setting MSB. Default value: 0. Watermark flag rises when the number of bytes written to FIFO after the next write is greater than or equal to the threshold level. Minimum resolution for the FIFO is 1LSB = 2 bytes (1 word) in FIFO. */
    uint8_t enFifoTemperature : 1;        /**< Enables the temperature data storage in FIFO. Default: 0. 0: temperature not included in FIFO; 1: temperature included in FIFO. */
    uint8_t notUsed01 : 4;                /**< These bits must be set to 0 for proper operation of the device. */
} ISDS_fifoCtrl2_t;

/**
 * @brief ISDS_FIFO_CTRL_3_REG
 * Address 0x08
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t fifoAccDecimation : 3;        /**< Accelerometer FIFO (second data set) decimation setting. Default: 0. See ISDS_fifoDecimation_t. */
    uint8_t fifoGyroDecimation : 3;       /**< Gyro FIFO (first data set) decimation setting. Default: 0. See ISDS_fifoDecimation_t. */
    uint8_t notUsed01 : 2;                /**< These bits must be set to 0 for proper operation of the device. */
} ISDS_fifoCtrl3_t;

/**
 * @brief ISDS_FIFO_CTRL_4_REG
 * Address 0x09
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t fifoThirdDecimation : 3;      /**< Third FIFO data set decimation setting. Default: 0. See ISDS_fifoDecimation_t. */
    uint8_t fifoFourthDecimation : 3;     /**< Fourth FIFO data set decimation setting. Default: 0. See ISDS_fifoDecimation_t. */
    uint8_t enOnlyHighData : 1;           /**< 8-bit data storage in FIFO. Default: 0. 0: disable MSB only memorization in FIFO for XL and Gyro; 1: enable MSB only memorization in FIFO for XL and Gyro in FIFO. */
    uint8_t enStopOnThreshold : 1;        /**< Enable FIFO threshold level use. Default value: 0. 0: FIFO depth is not limited; 1: FIFO depth is limited to threshold level. */
} ISDS_fifoCtrl4_t;

/**
 * @brief ISDS_FIFO_CTRL_5_REG
 * Address 0x0A
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t fifoMode : 3;                 /**< FIFO mode. See ISDS_fifoMode_t. */
    uint8_t fifoOdr : 4;                  /**< FIFO output data rate. See ISDS_fifoOutputDataRate_t. */
    uint8_t notUsed01 : 1;                /**< This bit must be set to 0 for proper operation of the device. */
} ISDS_fifoCtrl5_t;

/**
 * @brief ISDS_DRDY_PULSE_CFG_REG
 * Address 0x0B
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t notUsed01 : 7;                /**< These bits must be set to 0 for proper operation of the device. */
    uint8_t enDataReadyPulsed : 1;        /**< Enable pulsed data-ready mode. Default value: 0. 0: data-ready latched mode. Returns to 0 only after output data has been read; 1: data-ready pulsed mode. The data-ready pulses are 75 μs long. */
} ISDS_dataReadyPulseCfg_t;

/**
 * @brief ISDS_INT0_CTRL_REG
 * Address 0x0D
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t int0AccDataReady : 1;         /**< Accelerometer data-ready on INT0 pin. Default value: 0. */
    uint8_t int0GyroDataReady : 1;        /**< Gyroscope data-ready on INT0 pin. Default value: 0. */
    uint8_t int0Boot : 1;                 /**< Boot status on INT0 pin. Default value: 0. */
    uint8_t int0FifoThreshold : 1;        /**< FIFO threshold interrupt on INT0 pin. Default value: 0. */
    uint8_t int0FifoOverrun : 1;          /**< FIFO overrun interrupt on INT0 pin. Default value: 0. */
    uint8_t int0FifoFull : 1;             /**< FIFO full interrupt on INT0 pin. Default value: 0. */
    uint8_t notUsed01 : 2;                /**< These bits must be set to 0 for proper operation of the device. */
} ISDS_int0Ctrl_t;

/**
 * @brief ISDS_INT1_CTRL_REG
 * Address 0x0E
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t int1AccDataReady : 1;         /**< Accelerometer data-ready on INT1 pin. Default value: 0. */
    uint8_t int1GyroDataReady : 1;        /**< Gyroscope data-ready on INT1 pin. Default value: 0. */
    uint8_t int1TempDataReady : 1;        /**< Temperature data-ready on INT1 pin. Default value: 0. */
    uint8_t int1FifoThreshold : 1;        /**< FIFO threshold interrupt on INT1 pin. Default value: 0. */
    uint8_t int1FifoOverrun : 1;          /**< FIFO overrun interrupt on INT1 pin. Default value: 0. */
    uint8_t int1FifoFull : 1;             /**< FIFO full interrupt on INT1 pin. Default value: 0. */
    uint8_t notUsed01 : 2;                /**< These bits must be set to 0 for proper operation of the device. */
} ISDS_int1Ctrl_t;

/**
 * @brief ISDS_CTRL_1_REG
 * Address 0x10
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t accAnalogBandwidth : 1;       /**< Accelerometer analog chain bandwidth selection (only for accelerometer ODR ≥ 1.67 kHz). See ISDS_accAnalogChainBandwidth_t. */
    uint8_t accDigitalBandwidth : 1;      /**< Accelerometer digital LPF (LPF1) bandwidth selection. See ISDS_accDigitalLpfBandwidth_t. */
    uint8_t accFullScale : 2;             /**< Accelerometer full-scale selection. Default value: 0. See ISDS_accFullScale_t. */
    uint8_t accOutputDataRate : 4;        /**< Output data rate and power mode selection. Default value: 0. See ISDS_accOutputDataRate_t. */
} ISDS_ctrl1_t;

/**
 * @brief ISDS_CTRL_2_REG
 * Address 0x11
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t notUsed01 : 1;                /**< This bit must be set to 0 for proper operation of the device. */
    uint8_t gyroFullScale : 3;            /**< Gyroscope full-scale selection. Default value: 0. See ISDS_gyroFullScale_t. */
    uint8_t gyroOutputDataRate : 4;       /**< Output data rate and power mode selection. Default value: 0. See ISDS_gyroOutputDataRate_t. */
} ISDS_ctrl2_t;

/**
 * @brief ISDS_CTRL_3_REG
 * Address 0x12
 * Type  R/W
 * Default value: 0x04
 */
typedef struct
{
    uint8_t softReset : 1;                /**< Software reset. 0: normal mode; 1: SW reset; Self-clearing upon completion. */
    uint8_t notUsed01 : 1;                /**< This bit must be set to 0 for proper operation of the device. */
    uint8_t autoAddIncr : 1;              /**< Register address automatically incremented during a multiple byte access with I2C/SPI interface. Default: 1. 0: disable; 1: enable. */
    uint8_t spiMode : 1;                  /**< SPI serial interface mode. 0: 4-wire interface; 1: 3-wire interface. See ISDS_spiMode_t.*/
    uint8_t intPinConf : 1;               /**< Push-pull/open-drain selection on INT0 and INT1 pads. Default value: 0. 0: push-pull mode; 1: open-drain mode. See ISDS_interruptPinConfig_t. */
    uint8_t intActiveLevel : 1;           /**< Interrupt activation level. Default value: 0. 0: interrupt output pads active high; 1: interrupt output pads active low. See ISDS_interruptActiveLevel_t. */
    uint8_t blockDataUpdate : 1;          /**< Block data update. 0: continuous update; 1: output registers are not updated until MSB and LSB have been read. */
    uint8_t boot : 1;                     /**< Set this bit to 1 to initiate boot sequence. 0: normal mode; 1: Execute boot sequence. Self-clearing upon completion. */
} ISDS_ctrl3_t;

/**
 * @brief ISDS_CTRL_4_REG
 * Address 0x13
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t notUsed01 : 1;                  /**< This bit must be set to 0 for proper operation of the device. */
    uint8_t enGyroLPF1 : 1;                 /**< Enable gyroscope digital LPF1. 0: disabled; 1: enabled. */
    uint8_t i2cDisable : 1;                 /**< Disable I2C interface. Default value: 0. 0: both I2C and SPI enabled; 1: I2C disabled, SPI only. */
    uint8_t dataReadyMask : 1;              /**< Enables masking of the accelerometer and gyroscope data-ready signals until the settling of the sensor filters is completed. Default value: 0. 0: Masking disabled; 1: Masking enabled. */
    uint8_t dataEnableDataReadyOnInt0 : 1;  /**< Data enable (DEN) data ready signal on INT0 pad. Default value: 0. 0: disabled; 1: enabled. */
    uint8_t int1OnInt0 : 1;                 /**< All interrupt signals available on INT0 pad enable. Default value: 0. 0: interrupt signals divided between INT0 and INT1 pads; 1: all interrupt signals in logic or on INT0 pad. */
    uint8_t enGyroSleepMode : 1;            /**< Gyroscope sleep mode enable. Default value: 0. 0: disabled; 1: enabled. */
    uint8_t dataEnableExtendToAcc : 1;      /**< Extend data enable (DEN) functionality to accelerometer sensor. Default value: 0. 0: disabled; 1: enabled. */
} ISDS_ctrl4_t;

/**
 * @brief ISDS_CTRL_5_REG
 * Address 0x14
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t accSelfTest : 2;              /**< Accelerometer self-test enable. Default value: 0. See ISDS_accSelfTestMode_t. */
    uint8_t gyroSelfTest : 2;             /**< Gyroscope self-test enable. Default value: 0. See ISDS_gyroSelfTestMode_t. */
    uint8_t dataEnableActiveLevel : 1;    /**< Data enable (DEN) active level configuration. Default value: 0. 0: active low; 1: active high. */
    uint8_t rounding : 3;                 /**< Circular burst-mode (rounding) read from output registers through the primary interface. Default value: 0. See ISDS_roundingPattern_t. */
} ISDS_ctrl5_t;

/**
 * @brief ISDS_CTRL_6_REG
 * Address 0x15
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t gyroLowPassFilterType : 2;            /**< Gyroscope low-pass filter (LPF1) bandwidth selection. See ISDS_gyroLPF_t. */
    uint8_t notUsed01 : 1;                        /**< This bit must be set to 0 for proper operation of the device. */
    uint8_t userOffsetsWeight : 1;                /**< Weight of accelerometer user offset bits in registers ISDS_X_OFS_USR_REG, ISDS_Y_OFS_USR_REG, ISDS_Z_OFS_USR_REG. 0: 2^-10 g/LSB; 1: 2^-6 g/LSB. */
    uint8_t accHighPerformanceModeDisable : 1;    /**< High-performance operating mode disable for accelerometer. Default value: 0. 0: high-performance operating mode enabled; 1: high-performance operating mode disabled. */
    uint8_t dataEnableTriggerMode : 3;            /**< Data enable (DEN) trigger mode. See ISDS_dataEnableTriggerMode_t. */
} ISDS_ctrl6_t;

/**
 * @brief ISDS_CTRL_7_REG
 * Address 0x16
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t notUsed01 : 2;                        /**< These bits must be set to 0 for proper operation of the device. */
    uint8_t enRounding : 1;                       /**< Source register rounding function on ISDS_WAKE_UP_EVENT_REG, ISDS_TAP_EVENT_REG, ISDS_6D_EVENT_REG, ISDS_STATUS_REG and ISDS_FUNC_SRC_1_REG registers in the primary interface. Default value: 0. 0: rounding disabled; 1: rounding enabled. */
    uint8_t notUsed02 : 1;                        /**< This bit must be set to 0 for proper operation of the device. */
    uint8_t gyroDigitalHighPassCutoff : 2;        /**< Gyroscope digital HP filter cutoff selection. Default: 0. See ISDS_gyroDigitalHighPassCutoff_t. */
    uint8_t gyroDigitalHighPassEnable : 1;        /**< Gyroscope digital high-pass filter enable. The filter is enabled only if the gyro is in HP mode. Default value: 0. 0: HPF disabled; 1: HPF enabled. */
    uint8_t gyroHighPerformanceModeDisable : 1;   /**< High-performance operating mode disable for gyroscope. Default: 0. 0: high-performance operating mode enabled; 1: high-performance operating mode disabled. */
} ISDS_ctrl7_t;

/**
 * @brief ISDS_CTRL_8_REG
 * Address 0x17
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t en6dLowPass: 1;                 /**< LPF2 on 6D function selection. */
    uint8_t notUsed01 : 1;                  /**< This bit must be set to 0 for proper operation of the device. */
    uint8_t enAccHighPassSlopeFilter : 1;   /**< Accelerometer slope filter / high-pass filter selection. 0: the low-pass path of the composite filter block is selected; 1: the high-pass path of the composite filter block is selected. */
    uint8_t inputComposite : 1;             /**< Composite filter input selection. See ISDS_inputCompositeFilter_t. Default: 0. 0: ODR/2 low pass filtered sent to composite filter (default); 1: ODR/4 low pass filtered sent to composite filter. */
    uint8_t highPassFilterRefMode : 1;      /**< Enable HP filter reference mode (when enabled, the first output data has to be discarded). Default value: 0. 0: disabled; 1: enabled. */
    uint8_t accFilterConfig : 2;            /**< Accelerometer LPF2 and high-pass filter configuration and cutoff setting. See ISDS_accFilterConfig_t. */
    uint8_t enAccLowPass : 1;               /**< Accelerometer low-pass filter LPF2 selection. */
} ISDS_ctrl8_t;

/**
 * @brief ISDS_CTRL_9_REG
 * Address 0x18
 * Type  R/W
 * Default value: 0xE0
 */
typedef struct
{
    uint8_t notUsed01 : 4;                  /**< These bits must be set to 0 for proper operation of the device. */
    uint8_t dataEnableStampingSensor : 1;   /**< Data enable (DEN) stamping sensor selection. See ISDS_dataEnableStampingSensor_t. Default value: 0. 0: DEN pin info stamped in the gyroscope axis selected by bits [7:5]; 1: DEN pin info stamped in the accelerometer axis selected by bits [7:5]. */
    uint8_t dataEnableValueZ : 1;           /**< Data enable (DEN) value stored in LSB of Z-axis. Default value: 1. 0: DEN not stored in Z-axis LSB; 1: DEN stored in Z-axis LSB. */
    uint8_t dataEnableValueY : 1;           /**< Data enable (DEN) value stored in LSB of Y-axis. Default value: 1. 0: DEN not stored in Y-axis LSB; 1: DEN stored in Y-axis LSB. */
    uint8_t dataEnableValueX : 1;           /**< Data enable (DEN) value stored in LSB of X-axis. Default value: 1. 0: DEN not stored in X-axis LSB; 1: DEN stored in X-axis LSB. */
} ISDS_ctrl9_t;

/**
 * @brief ISDS_CTRL_10_REG
 * Address 0x19
 * Type  R/W
 * Default value: 0x00
 */
typedef struct
{
    uint8_t notUsed01 : 2;                  /**< These bits must be set to 0 for proper operation of the device. */
    uint8_t enEmbeddedFunc : 1;             /**< Enable embedded functionalities (tilt). Default value: 0. 0: disable functionalities of embedded functions and accelerometer filters; 1: enable functionalities of embedded functions and accelerometer filters. */
    uint8_t enTiltCalculation : 1;          /**< Enable tilt calculation. */
    uint8_t notUsed02 : 1;                  /**< This bit must be set to 0 for proper operation of the device. */
    uint8_t notUsed03 : 3;                  /**< These bits must be set to 0 for proper operation of the device. */
} ISDS_ctrl10_t;

/**
 * @brief ISDS_STATUS_REG
 * Address 0x1E
 * Type  R
 * Default value: 0x00
 */
typedef struct
{
    uint8_t accDataReady : 1;               /**< 1: New acceleration data available; 0: No new data available. */
    uint8_t gyroDataReady : 1;              /**< 1: New gyroscope data available; 0: No new data available. */
    uint8_t tempDataReady: 1;               /**< 1: New temperature data available; 0: No new data available. */
    uint8_t notUsed01 : 5;                  /**< These bits must be set to 0 for proper operation of the device. */
} ISDS_status_t;


/* Enum definitions */

