formosan-fox/STM32CubeIDE_source_files/Source/Inc/IMU_6DIM_WSEN_ISDS.h
typedef enum
{
	ISDS_disable = 0,
	ISDS_enable = 1
} ISDS_state_t;

typedef enum
{
	ISDS_accFullScaleTwoG       = 0,
	ISDS_accFullScaleSixteenG   = 1,
	ISDS_accFullScaleFourG      = 2,
	ISDS_accFullScaleEightG     = 3,
	ISDS_accFullScaleInvalid    = 4
} ISDS_accFullScale_t;

typedef enum
{
	ISDS_accOdrOff      =  0,
	ISDS_accOdr12Hz5    =  1,
	ISDS_accOdr26Hz     =  2,
	ISDS_accOdr52Hz     =  3,
	ISDS_accOdr104Hz    =  4,
	ISDS_accOdr208Hz    =  5,
	ISDS_accOdr416Hz    =  6,
	ISDS_accOdr833Hz    =  7,
	ISDS_accOdr1k66Hz   =  8,
	ISDS_accOdr3k33Hz   =  9,
	ISDS_accOdr6k66Hz   = 10,
	ISDS_accOdr1Hz6     = 11
} ISDS_accOutputDataRate_t;

typedef enum
{
	ISDS_gyroFullScale250dps   = 0,
	ISDS_gyroFullScale125dps   = 1,
	ISDS_gyroFullScale500dps   = 2,
	ISDS_gyroFullScale1000dps  = 4,
	ISDS_gyroFullScale2000dps  = 6
} ISDS_gyroFullScale_t;

typedef enum
{
	ISDS_gyroOdrOff    =  0,
	ISDS_gyroOdr12Hz5  =  1,
	ISDS_gyroOdr26Hz   =  2,
	ISDS_gyroOdr52Hz   =  3,
	ISDS_gyroOdr104Hz  =  4,
	ISDS_gyroOdr208Hz  =  5,
	ISDS_gyroOdr416Hz  =  6,
	ISDS_gyroOdr833Hz  =  7,
	ISDS_gyroOdr1k66Hz =  8,
	ISDS_gyroOdr3k33Hz =  9,
	ISDS_gyroOdr6k66Hz = 10
} ISDS_gyroOutputDataRate_t;


/* Class definitions */

class IMU_6DIM_WSEN_ISDS
{
public:
    // Construtor
    IMU_6DIM_WSEN_ISDS(SPI_HandleTypeDef* _spi_handler, GPIO_TypeDef *_CS_PORT, uint16_t _CS_PIN);

    // Setting
    bool init(
    	    ISDS_state_t blockDataUpdate = ISDS_enable,
    	    ISDS_accOutputDataRate_t accOutputDataRate = ISDS_accOdr104Hz,
    	    ISDS_gyroOutputDataRate_t gyroOutputDataRate = ISDS_gyroOdr104Hz,
    	    ISDS_accFullScale_t accFullScale = ISDS_accFullScaleFourG,
    	    ISDS_gyroFullScale_t gyroFullScale = ISDS_gyroFullScale500dps);

    // Usage example
    void example_loop();

    // ISDS_CTRL_1_REG
    HAL_StatusTypeDef setAccFullScale(ISDS_accFullScale_t fullScale);
    uint8_t getAccFullScale();          // TODO: error handler
    HAL_StatusTypeDef setAccOutputDataRate(ISDS_accOutputDataRate_t odr);
    uint8_t getAccOutputDataRate();     // TODO: error handler

    // ISDS_CTRL_2_REG
    HAL_StatusTypeDef setGyroFullScale(ISDS_gyroFullScale_t fullScale);
    uint8_t getGyroFullScale();         // TODO: error handler
    HAL_StatusTypeDef setGyroOutputDataRate(ISDS_gyroOutputDataRate_t odr);
    uint8_t getGyroOutputDataRate();    // TODO: error handler

    // ISDS_CTRL_3_REG
    HAL_StatusTypeDef enableBlockDataUpdate();
    HAL_StatusTypeDef disableBlockDataUpdate();
    bool isBlockDataUpdateEnabled();    // TODO: error handler

    // ISDS_STATUS_REG
    bool isAccelerationDataReady();     // TODO: error handler
    bool isGyroscopeDataReady();
    bool isTemperatureDataReady();

    // Accelerometer output
    float getAccelerationX_float();  // TODO: error handler
    float getAccelerationY_float();
    float getAccelerationZ_float();

    // Gyroscope output
    float getAngularRateX_float();  // TODO: error handler
    float getAngularRateY_float();
    float getAngularRateZ_float();

    // Temperature sensor output
    float getTemperature_float(); // TODO: error handler

private:
    // SPI Interface
    SPI_HandleTypeDef* spi_handler;
    GPIO_TypeDef* CS_PORT;
    uint16_t CS_PIN;

    ISDS_accFullScale_t currentAccFullScale;
    ISDS_gyroFullScale_t currentGyroFullScale;

    // Communication test
    uint8_t getDeviceID();

    float convertAcceleration_float(int16_t acc, ISDS_accFullScale_t fullScale);
    float convertAngularRate_float(int16_t rate, ISDS_gyroFullScale_t fullScale);

    inline HAL_StatusTypeDef ISDS_ReadReg(uint8_t regAddr, uint16_t numBytesToRead, uint8_t *buf);
    inline HAL_StatusTypeDef ISDS_WriteReg(uint8_t regAddr, uint16_t numBytesToWrite, uint8_t *data);
};


#endif
